posts/ray/index.html
<!DOCTYPE html>
<html prefix="
og: http://ogp.me/ns#
article: http://ogp.me/ns/article#
" lang="zh_cn">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width">
<title>ray | vincent blog</title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../rss.xml">
<link rel="canonical" href="https://wisonwang.github.io/posts/ray/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="vincent wang">
<meta property="og:site_name" content="vincent blog">
<meta property="og:title" content="ray">
<meta property="og:url" content="https://wisonwang.github.io/posts/ray/">
<meta property="og:description" content="Install

pip install ray 



import sys


print(sys.path)



['Users/vincent/anaconda3/envs/python36/lib/python36.zip', '/Users/vincent/anaconda3/envs/python36/lib/python3.6', '/Users/vincent/anaconda">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2021-01-07T15:40:53+08:00">
</head>
<body>
    <section class="social"><ul>
<li><a href="../../index.html" title="Home"><i class="icon-home"></i></a></li>
            <li><a href="../../archive.html" title="文章存档"><i class="icon-archive"></i></a></li>
            <li><a href="../../categories/" title="标签"><i class="icon-tags"></i></a></li>
            <li><a href="../../pages/about" title="About"><i class="icon-about"></i></a></li>
            <li><a href="../../rss.xml" title="RSS 源"><i class="icon-rss"></i></a></li>
            <li><a href="https://twitter.com/wisonwang" title="My Twitter"><i class="icon-twitter"></i></a></li>
            <li><a href="https://github.com/wisonwang" title="My Github"><i class="icon-github"></i></a></li>

        </ul></section><section class="page-content"><div class="content" rel="main">
    <div class="post">
        <h1 class="p-name entry-title" itemprop="headline name">ray</h1>

        <div class="meta">
            <div class="authordate">
                <time class="timeago" datetime="2021-01-07T15:40:53+08:00">2021-01-07 15:40</time>
            
                      |  
        <a href="index.org" id="sourcelink">源代码</a>

            </div>
            
        </div>
        <div class="body">
            <div id="outline-container-orga6275d2" class="outline-2">
<h2 id="orga6275d2">Install</h2>
<div class="outline-text-2" id="text-orga6275d2">
<div class="highlight"><pre><span></span>pip install ray 
</pre></div>


<div class="highlight"><pre><span></span><span class="kn">import</span> <span class="nn">sys</span>


<span class="nb">print</span><span class="p">(</span><span class="n">sys</span><span class="o">.</span><span class="n">path</span><span class="p">)</span>
</pre></div>

<p>
['<i>Users/vincent/anaconda3/envs/python36/lib/python36.zip', '/Users/vincent/anaconda3/envs/python36/lib/python3.6', '/Users/vincent/anaconda3/envs/python36/lib/python3.6/lib-dynload', '', '/Users/vincent/anaconda3/envs/python36/lib/python3.6/site-packages', '/Users/vincent/workspace/RecallAdminView', '/Users/vincent/anaconda3/envs/python36/lib/python3.6/site-packages/apollo-4.1-py3.6.egg', '/Users/vincent/anaconda3/envs/python36/lib/python3.6/site-packages/presto_python_client-0.7.0-py3.6.egg', '/Users/vincent/anaconda3/envs/python36/lib/python3.6/site-packages/Werkzeug-0.12.2-py3.6.egg', '/Users/vincent/anaconda3/envs/python36/lib/python3.6/site-packages/urllib3-1.22-py3.6.egg', '/Users/vincent/anaconda3/envs/python36/lib/python3.6/site-packages/thrift-0.11.0-py3.6.egg', '/Users/vincent/anaconda3/envs/python36/lib/python3.6/site-packages/SQLAlchemy-1.1.9-py3.6-macosx-10.7-x86_64.egg', '/Users/vincent/anaconda3/envs/python36/lib/python3.6/site-packages/requests-2.18.4-py3.6.egg', '/Users/vincent/anaconda3/envs/python36/lib/python3.6/site-packages/redis-2.10.5-py3.6.egg', '/Users/vincent/anaconda3/envs/python36/lib/python3.6/site-packages/PyMySQL-0.8.1-py3.6.egg', '/Users/vincent/anaconda3/envs/python36/lib/python3.6/site-packages/pymongo-3.4.0-py3.6-macosx-10.7-x86_64.egg', '/Users/vincent/anaconda3/envs/python36/lib/python3.6/site-packages/Jinja2-2.9.6-py3.6.egg', '/Users/vincent/anaconda3/envs/python36/lib/python3.6/site-packages/jedi-0.12.1-py3.6.egg', '/Users/vincent/anaconda3/envs/python36/lib/python3.6/site-packages/html5lib-0.9999999-py3.6.egg', '/Users/vincent/anaconda3/envs/python36/lib/python3.6/site-packages/happybase-1.1.0-py3.6.egg', '/Users/vincent/anaconda3/envs/python36/lib/python3.6/site-packages/gevent-1.2.2-py3.6-macosx-10.7-x86_64.egg', '/Users/vincent/anaconda3/envs/python36/lib/python3.6/site-packages/future-0.16.0-py3.6.egg', '/Users/vincent/anaconda3/envs/python36/lib/python3.6/site-packages/funcsigs-1.0.2-py3.6.egg', '/Users/vincent/anaconda3/envs/python36/lib/python3.6/site-packages/Flask_Admin-1.5.0-py3.6.egg', '/Users/vincent/anaconda3/envs/python36/lib/python3.6/site-packages/Flask-0.12.1-py3.6.egg', '/Users/vincent/anaconda3/envs/python36/lib/python3.6/site-packages/flake8-3.3.0-py3.6.egg', '/Users/vincent/anaconda3/envs/python36/lib/python3.6/site-packages/filelock-3.0.4-py3.6.egg', '/Users/vincent/anaconda3/envs/python36/lib/python3.6/site-packages/configparser-3.5.0-py3.6.egg', '/Users/vincent/anaconda3/envs/python36/lib/python3.6/site-packages/bcbio_gff-0.6.6-py3.6.egg', '/Users/vincent/anaconda3/envs/python36/lib/python3.6/site-packages/wrapt-1.12.0-py3.6-macosx-10.7-x86_64.egg', '/Users/vincent/anaconda3/envs/python36/lib/python3.6/site-packages/Click-7.0-py3.6.egg', '/Users/vincent/anaconda3/envs/python36/lib/python3.6/site-packages/cachetools-4.0.0-py3.6.egg', '/Users/vincent/anaconda3/envs/python36/lib/python3.6/site-packages/biopython-1.76-py3.6-macosx-10.7-x86_64.egg', '/Users/vincent/anaconda3/envs/python36/lib/python3.6/site-packages/idna-2.6-py3.6.egg', '/Users/vincent/anaconda3/envs/python36/lib/python3.6/site-packages/thriftpy-0.3.9-py3.6-macosx-10.7-x86_64.egg', '/Users/vincent/anaconda3/envs/python36/lib/python3.6/site-packages/greenlet-0.4.15-py3.6-macosx-10.7-x86_64.egg', '/Users/vincent/anaconda3/envs/python36/lib/python3.6/site-packages/WTForms-2.2.1-py3.6.egg', '/Users/vincent/anaconda3/envs/python36/lib/python3.6/site-packages/itsdangerous-1.1.0-py3.6.egg', '/Users/vincent/anaconda3/envs/python36/lib/python3.6/site-packages/pyflakes-1.5.0-py3.6.egg', '/Users/vincent/anaconda3/envs/python36/lib/python3.6/site-packages/pycodestyle-2.3.1-py3.6.egg', '/Users/vincent/anaconda3/envs/python36/lib/python3.6/site-packages/ply-3.11-py3.6.egg', '/Users/vincent/workspace/video_analyze', '/Users/vincent/workspace/vmaf-python/src', '/Users/vincent/anaconda3/envs/python36/lib/python3.6/site-packages/sureal-0.4.2-py3.6.egg', '/Users/vincent/anaconda3/envs/python36/lib/python3.6/site-packages/h5py-2.10.0-py3.6-macosx-10.7-x86_64.egg', '/Users/vincent/anaconda3/envs/python36/lib/python3.6/site-packages/scikit_image-0.17.2-py3.6-macosx-10.7-x86_64.egg', '/Users/vincent/anaconda3/envs/python36/lib/python3.6/site-packages/tifffile-2020.6.3-py3.6.egg', '/Users/vincent/anaconda3/envs/python36/lib/python3.6/site-packages/networkx-2.4-py3.6.egg', '/Users/vincent/anaconda3/envs/python36/lib/python3.6/site-packages/imageio-2.8.0-py3.6.egg', '/Users/vincent/anaconda3/envs/python36/lib/python3.6/site-packages/PyWavelets-1.1.1-py3.6-macosx-10.7-x86_64.egg', '/Users/vincent/anaconda3/envs/python36/lib/python3.6/site-packages/decorator-4.3.0-py3.6.egg', '/Users/vincent/anaconda3/envs/python36/lib/python3.6/site-packages/IPython/extensions', '/Users/vincent</i>.ipython']
</p>
</div>
</div>
        </div>
        
                            <div id="disqus_thread"></div>
        <script>
        var disqus_shortname ="wisonwanghomepage",
            disqus_url="https://wisonwang.github.io/posts/ray/",
        disqus_title="ray",
        disqus_identifier="cache/posts/ray.html",
        disqus_config = function () {
            this.language = "zh_cn";
        };
        (function() {
            var dsq = document.createElement('script'); dsq.async = true;
            dsq.src = 'https://' + disqus_shortname + '.disqus.com/embed.js';
            (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
        })();
    </script><noscript>Please enable JavaScript to view the <a href="https://disqus.com/?ref_noscript" rel="nofollow">comments powered by Disqus.</a>
</noscript>
    <a href="https://disqus.com" class="dsq-brlink" rel="nofollow">Comments powered by <span class="logo-disqus">Disqus</span></a>


    </div>
                     <footer id="footer"><p>Contents © 2022         <a href="mailto:fangfu2012@gmail.com">vincent wang</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         </p>
            
        </footer>
</div>
    </section><script src="../../assets/js/all-nocdn.js" type="text/javascript"></script><script type="text/javascript" src="https://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"> </script><script type="text/x-mathjax-config">
    MathJax.Hub.Config({tex2jax: {inlineMath: [['$latex ','$'], ['\\(','\\)']]}});
    </script><script type="text/javascript">
            $(function(){
                $('.timeago').timeago();
            });
        </script>
</body>
</html>
